brew "git"
brew "asdf"
brew "sqlite"
brew "awscli"
brew "bat"
brew "cmatrix"
brew "coreutils"
brew "curl"
brew "dmenu"
brew "docker"
brew "docker-compose"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "httpie"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "libavif"
brew "lua"
brew "mtr"
brew "mysql", restart_service: :changed
brew "neovim"
brew "nextdns"
brew "node"
brew "oath-toolkit"
brew "postgresql@17", restart_service: :changed
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "rustup"
brew "telnet"
brew "tldr"
brew "tmux"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh"
cask "alt-tab"
cask "appcleaner"
cask "bitwarden"
cask "blender"
cask "bruno"
cask "cursor"
cask "discord"
cask "dropbox"
cask "filen"
cask "firefox@nightly"
cask "ghostty"
cask "google-chrome@canary"
cask "hammerspoon"
cask "kap"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "monitorcontrol"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "safari-technology-preview"
cask "shottr"
cask "signal"
cask "slack"
cask "telegram"
cask "tor-browser"
cask "zed"
cask "zoom"
